# CanBeSplit Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewCropRegionShapeManager..::..CanBeSplit Property
ViewCropRegionShapeManager Class See Also
---
Verifies that the crop of the associated view is permitted to have multiple regions.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool CanBeSplit { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CanBeSplit As Boolean
	Get
```

Visual C++
---
```text
public:
property bool CanBeSplit {
	bool get ();
}
```

# See Also
ViewCropRegionShapeManager Class
Autodesk.Revit.DB Namespace